app/controllers/users_controller.rb

INSERT INTO "users" ("email", "name", "password_digest", "remember_token") VALUES (?, ?, ?, ?)  [["email", "user@example.com"], ["name", "Example User"], ["password_digest", "$2a$04$93oQb9H1hrqgwc.tiESlNO3MzsRsU44A4Q6biSC8M/uevZYAHKyXO"], ["remember_token", "NQq43znV_Ty7hV0BCv8Csg"]]
---
   def create
	@user = User.new(params[:user])
		if @user.save